export const about = {
	title: '关于我们',
	intro: '网站域名：xuegushi.com',
	article: [
		{
			title: '1、简单介绍',
			contents: [],
			article: [
				{
					title: '1.1 关于',
					content: [
						'学古诗(xuegushi.com)是一个关于中国传统文化的网站。网站的侧重点是收集并分类展示古诗文(包括诗词曲赋文言文)以及一些现代诗歌。',
						'学古诗收集大量的古诗文并且对其分类，主要通过形式（诗词曲文言文等）、类型（咏物，写景等）、朝代，对其进行分类。',
						'网站以及小程序由 "小小梦工场" 个人维护，内容收集自互联网。',
					],
				},
			],
		},
		{
			title: '2、搜索功能',
			contents: [],
			article: [
				{
					title: '2.1 搜索记录',
					content: ['搜索记录是记录你的搜索历史，内容缓存在本地。'],
				},
				{
					title: '2.2 搜索热点',
					content: [
						'搜索热点是指，当天被搜索次数最多的8个词。如果没显示，说明当天还没有人搜索。',
					],
				},
				{
					title: '2.3 搜索结果',
					content: [
						'搜索结果共分为四项。分别为：类型，诗人，名句以及诗词。',
						'类型，是指对诗词进行分类的标签类型。具体可看诗词详情页正文下方的绿色“徽章”。',
						'诗人，对应的是对诗人的名字进行匹配后所得的结果。',
						'名句是指，包含搜索词的热门句子。',
						'诗词是指，标题中包含搜索词的诗词，此处并没有对诗词的原文内容进行检索。',
					],
				},
			],
		},
		// {
		// 	title: '3、朗读功能',
		// 	contents: [
		// 		'朗读功能使用的是百度AI的语音合成技术。首先将文字合成为MP3格式的音频，然后来下载到本地播放。',
		// 		'由于功能限制，合成的语音对诗词的字数有限制。只能合成诗词的前512个字（包括标点符号），暂时没有做相关的分批合成优化。',
		// 	],
		// 	article: [],
		// },
		{
			title: '3、广告功能',
			contents: [
				'因为小程序需要后台服务器支持，而域名和服务器都是需要花费的，所以暂时在搜索页面、个人页面以及诗文详情页添加了广告插件。希望大家能够理解。',
			],
			article: [],
		},
	],
};

export const privateRule = {
	title: '《用户服务协议及隐私政策》',
	intro: '',
	article: [
		{
			title: '1.隐私说明',
			contents: [
				'根据法律规定，开发者仅处理实现小程序功能所必要的信息',
				'为了正常提供团队信息给团队成员，开发者收集你的用户信息（昵称、头像）信息。',
			],
			article: [],
		},
		{
			title: '2.你的权益',
			contents: [
				'开发者承诺，除法律法规另有规定外，开发者对你的信息的保存期限应当为实现处理目的所必要的最短时间。',
				'关于授权，你可以通过以下路径：小程序主页右上角&quot;.&quot;—&quot;设置&quot;一点击特定信息一点击&quot;不允许&quot;，撤回对开发者的授权。关于你的个人信息，你可以通过以下方式与开发者联系，行使查阅、复制、更正、删除等法定权利。',
			],
			article: [],
		},
		{
			title: '3.开发者对信息的存储',
			contents: [
				'开发者承诺，除法律法规另有规定外，开发者对你的信息的保存期限应当为实现处理目的所必要的最短时间。开发者将你的信息存储在 中国大陆。',
			],
			article: [],
		},
		{
			title: '4.信息的使用规则',
			contents: [
				'开发者将会在本指引所明示的用途内使用收集的信息如开发者使用你的信息超出本指引目的或合理范围，开发者必须在变更使用目的或范围前，再次告知并征得你的明示同意。',
			],
			article: [],
		},
		{
			title: '5.信息对外提供',
			contents: [
				'开发者承诺，不会对外公开披露你的信息，如必须公开披露时，开发者应当向你告知公开披露的目的、披露信息的类型及可能涉及的信息，并征得你的单独同意。',
				'你认为开发者未遵守上述约定，或有其他的投诉建议、或未成年人个人信息保护相关问题，可通过以下方式与开发者联系；或者像微信进行投诉。',
				'me@johnnyzhang.cn',
			],
			article: [],
		},
	],
};
